{
  "broadArea": {
    "name": "Electronics and Communication Engineering",
    "link": "https://www.vlab.co.in/broad-area-electronics-and-communications",
    "code": "ECE"
  },
  "lab": "Internet of Things Virtual Lab",
  "lab_display_name": "Internet of Things Virtual Lab",
  "phase": "3-ext",
  "collegeName": "DLBG",
  "baseUrl": "iot-dei.vlabs.ac.in",
  "introduction": "The Internet of Things (IoT) Virtual Lab is designed to provide comprehensive practical exposure to embedded systems and smart connectivity technologies in a simulated environment. It enables students to understand the interaction between sensors, actuators, microcontrollers, and cloud platforms without requiring physical hardware. The laboratory covers fundamental concepts of input–output interfacing using Arduino and ESP8266/ESP32 modules. It introduces communication protocols such as HTTP, MQTT, I2C, and LoRaWAN used in modern IoT systems. Students gain hands-on experience in real-time data acquisition, processing, and transmission. The lab also emphasizes cloud integration with platforms such as AWS, Microsoft Azure, ThingSpeak, and IBM Bluemix. Through simulation-based experimentation, learners can visualize device behavior and data flow in IoT architecture. The virtual environment supports experimentation with networking models including client–server and publish–subscribe mechanisms. It enhances understanding of dashboard development and remote monitoring systems. The lab promotes practical learning of scalable, low-power, and long-range communication technologies. It bridges the gap between theoretical concepts and real-world IoT implementation. Overall, the IoT Virtual Lab fosters innovation, problem-solving skills, and system-level understanding of smart connected ecosystems.",
  "experiments":[
  {
    "name": "To simulate interfacing of basics input components (pushbutton, potentiometer, slider switch and photoresistor) with Arduino",
    "short-name": "basics-input-components",
    "repo": "https://github.com/virtual-labs/exp-basics-input-components-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "To simulate interfacing of basics output components (RGB LED, 7 segment, OLED, LCD 16×2 and buzzer) with Arduino",
    "short-name": "basics-output-components",
    "repo": "https://github.com/virtual-labs/exp-basics-output-components-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "To simulate interfacing of multiple motors (DC Motor, Servo Motor and Stepper Motor) with Arduino",
    "short-name": "multiple-motors",
    "repo": "https://github.com/virtual-labs/exp-multiple-motors-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "To simulate interfacing of multiple sensors (Ultrasonic sensor, PIR Sensor, DHT sensor, Soil Moisture, MQ135 Sensors) with Arduino",
    "short-name": "multiple-sensors",
    "repo": "https://github.com/virtual-labs/exp-multiple-sensors-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Simulation of sending live sensors data on IoT Platform using HTTP Protocols and ESP8266/ESP32",
    "short-name": "http-protocols",
    "repo": "https://github.com/virtual-labs/exp-http-protocols-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Simulation of sending live sensors data on IoT Platform using MQTT Protocols and ESP8266/ESP32",
    "short-name": "mqtt-protocols",
    "repo": "https://github.com/virtual-labs/exp-mqtt-protocols-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Simulation of establishing master slave model using Arduino and I2C Protocols",
    "short-name": "master-slave-model",
    "repo": "https://github.com/virtual-labs/exp-master-slave-model-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Simulation of establishing interrelation between cloud (AWS, Microsoft Azure, ThingSpeak and IBM Bluemix) and ESP8266/ESP32",
    "short-name": "cloud-interrelation",
    "repo": "https://github.com/virtual-labs/exp-interrelation-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "To create IoT Dashboard for remote monitoring",
    "short-name": "remote-monitoring-dashboard",
    "repo": "https://github.com/virtual-labs/exp-remote-monitoring-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "To create IoT Application using LoRaWAN and ESP8266/ESP32",
    "short-name": "lorawan-application",
    "repo": "https://github.com/virtual-labs/exp-lorawan-dei",
    "tag": "v1.0.0",
    "deploy": true
  }
],
  "targetAudience": {
    "UG": [
      "The laboratory is intended for undergraduate (3rd and 4th year) engineering students, faculty members, and research scholars pursuing studies in Internet of Things, Embedded Systems, and related domains."
    ],
    "PG": [
      "The laboratory is intended for postgraduate (1st year) engineering students, faculty members, and research scholars pursuing studies in Internet of Things, Embedded Systems, and related domains."
    ]
  },
  "objective": "<ul><li>To make students understand and appreciate the applications of IoT, AI and robotics.</li> <li>To inculcate in students the practical understanding of Embedded and Cloud Computing Principles by letting them through simulation-based experiments.</li> <li>To generate simulation programs so that everyone can experience the outcomes of various parameter changes on the virtual experiments.</li> <li>To develop an understanding of embedded systems and how to establish communication between two devices (Microcontroller Unit).</li></ul>",
  "courseAlignment": {
    "description": "The syllabi of this lab aligns to the following universities in India.",
    "universities": [
      "The Internet of Things Virtual Lab aligns with courses such as Internet of Things, Embedded Systems, Wireless Sensor Networks, and Cloud Computing. It supports university and AICTE-prescribed curriculum by integrating theoretical concepts with practical simulation-based experiments. The lab strengthens understanding of sensor interfacing, microcontroller programming, and communication protocols."
    ]

  }
}
